/******************************************************************************

                  版权所有 (C), 2023-2023，78157

 ******************************************************************************
  文 件 名   : selectionSort.c
  版 本 号   : 初稿
  作    者   : 78157
  生成日期   : 2023/1/4
  最近修改   :
  功能描述   : 選擇排序
  函数列表   :
  修改历史   :
  1.日    期   : 2023/1/4
    作    者   : 78157
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include <stdio.h>

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
void data_change(int *data1, int *data2)
{
    int tmp;

    tmp = *data1;
    *data1 = *data2;
    *data2 = tmp;
}

int selectionSort(int *data, int length)
{
    int minimum, minimum_index;
    int i, j;

    for(i = 0; i < length - 1; i++){
        minimum_index = i;

        for(j = i + 1; j < length; j++) {
            if (data[minimum_index] > data[j]) {
                minimum_index = j;
            }
        }
        //交换值
        data_change(&data[minimum_index], &data[i]);
    }
}

void print_array(int *array, int length)
{
    int index;
    printf("\r\n");

    for(index = 0; index < length; index++){
        printf("%d ", array[index]);
    }

    printf("\r\n");
}

void main(void)
{
    int array[7] = {6, 3, 1, 7, 2, 9, 4};
    int array_length;

    array_length = sizeof(array) / sizeof(array[0]);

    selectionSort(array, array_length);

    print_array(array, array_length);
}